legalsolarTermsHolidayDic={'清明':'清明节'}
legalHolidaysDic={(1,1):'元旦节',(5,1):'国际劳动节',(10,1):'国庆节'}
legalLunarHolidaysDic={(1,1):'春节',(5,5):'端午节',(8,15):'中秋节'}


#复活节:每年春分后月圆第一个星期天  母亲节:每年5月份的第2个星期日  父亲节:每年6月份的第3个星期天感恩节 每年11月最后一个星期四
# otherEastHolidaysList={5:(2,7,'母亲节'),6:(3,7,'父亲节')}
otherLunarHolidaysList=[
    {1: '弥勒佛圣诞', 8: '五殿阎罗天子诞', 9: '玉皇上帝诞', 15: '元宵节'},
    {1: '一殿秦广王诞', 2: '春龙节-福德土地正神诞', 3: '文昌帝君诞', 6: '东华帝君诞', 8: '释迦牟尼佛出家', 15: '释迦牟尼佛般涅槃', 17: '东方杜将军诞', 18: '至圣先师孔子讳辰', 19: '观音大士诞', 21: '普贤菩萨诞'},
    {1: '二殿楚江王诞', 3: '三月三-玄天上帝诞', 8: '六殿卞城王诞', 15: '昊天上帝诞', 16: '准提菩萨诞', 19: '中岳大帝诞', 20: '子孙娘娘诞', 27: '七殿泰山王诞', 28: '苍颉至圣先师诞'},
    {1: '八殿都市王诞', 4: '文殊菩萨诞', 8: '释迦牟尼佛诞', 14: '纯阳祖师诞', 15: '钟离祖师诞', 17: '十殿转轮王诞', 18: '紫徽大帝诞', 20: '眼光圣母诞'},
    {1: '南极长生大帝诞', 8: '南方五道诞', 11: '天下都城隍诞', 12: '炳灵公诞', 13: '关圣降', 16: '天地元气造化万物之辰', 18: '张天师诞', 22: '孝娥神诞'},
    {19: '观世音菩萨成道日', 24: '关帝诞'},
    {7: '七夕-魁星诞', 13: '长真谭真人诞-大势至菩萨诞', 15: '中元节', 18: '西王母诞', 19: '太岁诞', 22: '增福财神诞', 29: '杨公忌', 30: '地藏菩萨诞'},
    {1: '许真君诞', 3: '司命灶君诞', 5: '雷声大帝诞', 10: '北斗大帝诞', 12: '西方五道诞', 16: '天曹掠刷真君降', 18: '天人兴福之辰', 23: '汉恒候张显王诞', 24: '灶君夫人诞', 29: '至圣先师孔子诞'},
    {1: '北斗九星降世', 3: '五瘟神诞', 9: '重阳节-酆都大帝诞', 13: '孟婆尊神诞', 17: '金龙四大王诞', 19: '观世音菩萨出家', 30: '药师琉璃光佛诞'},
    {1: '寒衣节', 3: '三茅诞', 5: '达摩祖师诞', 8: '佛涅槃日', 15: '下元节'},
    {4: '至圣先师孔子诞', 6: '西岳大帝诞', 11: '太乙救苦天尊诞', 17: '阿弥陀佛诞', 19: '太阳日宫诞', 23: '张仙诞', 26: '北方五道诞'},
    {8: '腊八节-释迦如来成佛之辰', 16: '南岳大帝诞', 21: '天猷上帝诞', 23: '小年', 24: '子时灶君上天朝玉帝', 29: '华严菩萨诞', 30: '除夕'}
]
